_posts/2010-08-28-bleeding-edge-clojure-google-app-engine.html


---
layout: default
title: Bleeding Edge. Clojure на Google App Engine.
---


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Предыстория </h2>
<div class="outline-text-2" id="text-1">


<p>
Когда у гугловского облачного хостинга <a href="http://appspot.com/">Google App Engine</a> появилась
поддержка Java стало возможным писать для него приложения не только на
Java, но и на языках работающих на базе JVM. Для лисперов такая
возможность не осталась не замеченной, что отразилось на некотором
<a href="http://googlecode.blogspot.com/2010/05/better-performance-in-app-engine-with.html">позитивном</a> бурлении заграничной и <a href="http://habrahabr.ru/blogs/development/95079/">негативном</a> бурлении нашей блогосферы
по этому поводу. <a href="http://www.hackers-with-attitude.com/">Здравые</a> же лисперы воодушевились опытом автора
<a href="http://en.wikipedia.org/wiki/Viaweb">первого веб-приложения</a> и написали для App Engine своё:
<a href="https://the-deadline.appspot.com">https://the-deadline.appspot.com</a>.
</p>
<p>
В меру сил они поделились советом и кодом с миром, но в целом
инфраструктура для написания веб-приложений для GAE на Clojure
оставляет желать лучшего. Нет, написать-то можно всё что угодно, и это
будет без проблем работать, вот только нужно очень попотеть чтобы
собрать мозаику из разрозненных по Сети кусочков кода, тоесть
шаблон-заготовку проекта в котором можно будет без проблем
использовать все преимущества стиля разработки на лиспе (полноценный
REPL в котором работают <b>все</b> оффлайновые инструменты из GAE SDK).
</p>
<p>
У сообщества еще много дел, а я расскажу о той мозаике, что мне
удалось собрать за денек-другой. Результаты мои малы и неутешительны,
eно стоят того чтобы поведать о них и избавить заинтересованных
людей. По ходу появления в интернетах стабильных приемов работы с GAE,
возможно, я буду писать о ней в этот бложик.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Шаблон GAE-приложения </h2>
<div class="outline-text-2" id="text-2">


<p>
На сегодня я могу рассказать лишь о с любовью заготовленном мною
файле-конфигурации <b>project.clj</b> <a href="http://alexott.net/ru/clojure/ClojureLein.html">пакетного менеджера leiningen</a>. Этого
будет достаточно чтобы приступить к чтению одного из <a href="http://compojureongae.posterous.com/">гайдов</a> по
написанию гостевой для GAE. В шаблоне я использую свежайшие на сегодня
версии необходимых библиотек, ибо это наиболее разумный вариант
(правда, со старым софтом в некоторых сетапах проблем гораздо меньше).
</p>
<p>
Всё просто:
</p><ol>
<li>
Создаём новый Clojure-проект:
<pre class="example">
lein new guestbook
</pre>


</li>
<li>
Редактируем <b>project.clj</b> до следующего состояния:
   <script src="http://gist.github.com/423627.js"></script>

</li>
<li>
Получаем все необходимые jar'ы командой:
<pre class="example">
lein deps
</pre>

<p>В итоге мы имеем:
</p><dl>
<dt>Clojure и Clojure-contrib</dt><dd>
Самой последней версии.
</dd>
<dt>Compojure</dt><dd>
Фреймворк для веб-программирования на Clojure.
</dd>
<dt>Jetty</dt><dd>
Java HTTP-сервер.
</dd>
<dt>Ring</dt><dd>
Библиотека на Clojure для работы с HTTP.
</dd>
<dt>Hiccup</dt><dd>
Библиотека для генерации HTML прямо из лиспокода.
</dd>
<dt>Enlive</dt><dd>
Библиотека HTML-шаблонов на Clojure.
</dd>
<dt>Google App Engine SDK</dt><dd>
Библиотеки для работы (онлайн и оффлайн)
с Google App Engine. Оффлайновые, перед отправкой приложения в
облако следует удалить.

</dd>
</dl>
</li>
<li>
Что делать дальше? Узнаете в каком-нибудь другом блоге.
</li>
</ol>
</div>
</div>
